In [7]:
import pandas as pd
import numpy as np

##### Series

In [5]:
s = pd.Series([45,22,17,5,33,16,85])

In [6]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int64

In [8]:
s = pd.Series([45,22,17,5,33,16,85], dtype=np.int8)

In [9]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int8

In [10]:
s[4] = 99

In [11]:
s

0    45
1    22
2    17
3     5
4    99
5    16
6    85
dtype: int8

In [12]:
type(s)

pandas.core.series.Series

In [13]:
s.dtype

dtype('int8')

In [14]:
s.size

7

In [15]:
s.shape

(7,)

In [16]:
s.values

array([45, 22, 17,  5, 99, 16, 85], dtype=int8)

##### DataFrame

In [21]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['nitin', 'ranja', 'rani', 'priya', 'manoj'])
m = pd.Series([56.34, 76.23, 67.89, 77.45, 71.34])

In [22]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [23]:
df

   roll   name  marks
0     1  nitin  56.34
1     2  ranja  76.23
2     3   rani  67.89
3     4  priya  77.45
4     5  manoj  71.34

In [24]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.shape # no of rows and columns

(5, 3)

In [28]:
df.size #  total no of elements in the table

15

##### Dataset link

In [29]:
# https://mitu.co.in/dataset
# Download all the files whose name starts with student *
# Store in current working directory in folder datasets

##### Handling Actual Data

##### Load the data

In [30]:
df = pd.read_csv('datasets/student.csv')

In [31]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
df.shape

(10, 5)

In [33]:
df.size

50

In [35]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [36]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df1 =pd.read_csv('datasets/student1.csv')

In [39]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [40]:
# no header present above

In [45]:
df1 =pd.read_csv('datasets/student1.csv', names = ['A', 'B','C','D','E'])

In [43]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [46]:
None

In [47]:
df1 =pd.read_csv('datasets/student1.csv', names = None) # names has none as default parameter

In [48]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [49]:
df1 =pd.read_csv('datasets/student1.csv', names = None), header = None)

In [50]:
df1

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [53]:
df2 =pd.read_csv('datasets/student3.tsv')

In [54]:
df2

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [58]:
df2 =pd.read_csv('datasets/student3.tsv', sep = '\t') # separator we can mention

In [59]:
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [62]:
# We can direct use the data from internet even if the data is continuosly changing

In [63]:
df3 = pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')

In [65]:
df3

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

##### Access Data Information

In [67]:
df3.shape

(150, 5)

In [69]:
df3.size

750

In [70]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [71]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [74]:
df.values # convert dataframe to array of list

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [76]:
df.T # transpose the dataframe , rows become columns and vice versa

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [77]:
# snapshot of the data if we want

In [82]:
df.head() # default value is 5 , it show 5 rows from upside

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [84]:
df.head(3) # first 3 rows it show

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [85]:
df.tail() # last five rows it show

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

##### Index base Slicing

In [86]:
x = df.iloc[2:8, 1:4]
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [89]:
x = df.iloc[:8, 1:]

In [90]:
x

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23

In [91]:
x = df.iloc[2:, 1:]

In [92]:
x

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [95]:
x = df.iloc[[3,7,5,9],:]

In [96]:
x

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21

In [97]:
x= df.iloc[[3,7,5,9],[1,3]]

      name  marks
3  ajinkya  69.66
7    amita  68.33
5   ayesha  49.55
9    anmol  78.66

In [99]:
x

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21

In [100]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [101]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [102]:
df.iloc[3,1]

'ajinkya'

##### Label Base Slicing

In [103]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [109]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [110]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [112]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [113]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [114]:
df.age

0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64

In [115]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [117]:
df.name.values # converted to array form

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [119]:
df.drop(5) # row no 5 will be dropped, df not modified

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [122]:
df.drop([5,4,9]) # drop rows by default works on rows 
# if we want to work this on column , we need to change axis

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [123]:
df.drop('class', axis = 1) # 1 for column

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [124]:
df.drop(['class', 'age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [131]:
df.shape

(10, 3)

In [130]:
df.drop(['class', 'age'], axis = 1, inplace = True) # to delete the columns selected and store

KeyError: "['class', 'age'] not found in axis"

In [128]:
df.shape

(10, 3)

In [133]:
df['marks'].mean()

64.499

In [134]:
df['marks'].min()

49.55

In [135]:
df['marks'].max()

78.66

In [136]:
df['marks'].median()

64.31

In [137]:
df['marks'].sum()

644.9899999999999

In [138]:
df['marks'].std()

9.207178901994535

In [139]:
df.count()

roll     10
name     10
marks    10
dtype: int64

In [141]:
df = pd.read_csv('datasets/student.csv')

In [142]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [144]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [148]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [146]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [150]:
df.sum()

roll      55.00
marks    644.99
age      205.00
dtype: float64

In [149]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [151]:
df.sum(numeric_only=True)

roll      55.00
marks    644.99
age      205.00
dtype: float64

In [152]:
# add by row by row

In [153]:
df.sum(axis =1, numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [154]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [155]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [157]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [158]:
df.sort_values('class', ascending=False)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [159]:
df.sort_values('name')

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
6     7     amar    BE  65.34   19
1     2     amit    TE  59.77   21
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
0     1     anil    TE  56.77   22
9    10    anmol    BE  78.66   21
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20

In [161]:
df.sort_values(['class', 'marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

In [162]:
df.sort_values(['marks', 'class', ])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21

In [163]:
df.sort_values(['class', 'marks','age'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

##### Custom Column Operations

In [164]:
df['marks'] + 0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [165]:
df['marks'] = df['marks'] + 0.5

In [166]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [167]:
df['cgpa'] = df['marks']/10 + 0.034

In [168]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  5.761
1     2     amit    TE  60.27   21  6.061
2     3   aniket    BE  77.38   19  7.772
3     4  ajinkya    TE  70.16   20  7.050
4     5     asha    TE  63.78   20  6.412
5     6   ayesha    BE  50.05   20  5.039
6     7     amar    BE  65.84   19  6.618
7     8    amita    BE  68.83   23  6.917
8     9     amol    TE  57.25   20  5.759
9    10    anmol    BE  79.16   21  7.950

In [170]:
df['first_class'] = df['marks']>60
df

   roll     name class  marks  age   cgpa  first_class
0     1     anil    TE  57.27   22  5.761        False
1     2     amit    TE  60.27   21  6.061         True
2     3   aniket    BE  77.38   19  7.772         True
3     4  ajinkya    TE  70.16   20  7.050         True
4     5     asha    TE  63.78   20  6.412         True
5     6   ayesha    BE  50.05   20  5.039        False
6     7     amar    BE  65.84   19  6.618         True
7     8    amita    BE  68.83   23  6.917         True
8     9     amol    TE  57.25   20  5.759        False
9    10    anmol    BE  79.16   21  7.950         True

In [171]:
x = ['M','M','M','M','M','F','M','F','F','F']

In [172]:
df['gender'] =x
df

   roll     name class  marks  age   cgpa  first_class gender
0     1     anil    TE  57.27   22  5.761        False      M
1     2     amit    TE  60.27   21  6.061         True      M
2     3   aniket    BE  77.38   19  7.772         True      M
3     4  ajinkya    TE  70.16   20  7.050         True      M
4     5     asha    TE  63.78   20  6.412         True      M
5     6   ayesha    BE  50.05   20  5.039        False      F
6     7     amar    BE  65.84   19  6.618         True      M
7     8    amita    BE  68.83   23  6.917         True      F
8     9     amol    TE  57.25   20  5.759        False      F
9    10    anmol    BE  79.16   21  7.950         True      F

In [173]:
ndf= pd.DataFrame({
    'roll': range(1,11),
    'cgpa':df['marks']/10 + 0.034,
    'gender':['M','M','M','M','M','F','M','F','F','F']
})

In [174]:
ndf

   roll   cgpa gender
0     1  5.761      M
1     2  6.061      M
2     3  7.772      M
3     4  7.050      M
4     5  6.412      M
5     6  5.039      F
6     7  6.618      M
7     8  6.917      F
8     9  5.759      F
9    10  7.950      F

In [178]:
df = pd.read_csv('datasets/student.csv')

In [179]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [180]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [181]:
df.merge(ndf, on = 'roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.761      M
1     2     amit    TE  59.77   21  6.061      M
2     3   aniket    BE  76.88   19  7.772      M
3     4  ajinkya    TE  69.66   20  7.050      M
4     5     asha    TE  63.28   20  6.412      M
5     6   ayesha    BE  49.55   20  5.039      F
6     7     amar    BE  65.34   19  6.618      M
7     8    amita    BE  68.33   23  6.917      F
8     9     amol    TE  56.75   20  5.759      F
9    10    anmol    BE  78.66   21  7.950      F

In [182]:
ndf.merge(df, on = 'roll')

   roll   cgpa gender     name class  marks  age
0     1  5.761      M     anil    TE  56.77   22
1     2  6.061      M     amit    TE  59.77   21
2     3  7.772      M   aniket    BE  76.88   19
3     4  7.050      M  ajinkya    TE  69.66   20
4     5  6.412      M     asha    TE  63.28   20
5     6  5.039      F   ayesha    BE  49.55   20
6     7  6.618      M     amar    BE  65.34   19
7     8  6.917      F    amita    BE  68.33   23
8     9  5.759      F     amol    TE  56.75   20
9    10  7.950      F    anmol    BE  78.66   21

In [183]:
# Concatenation

In [184]:
df5 = pd.read_csv('datasets/student5.csv')

In [185]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [187]:
pd.concat([df, df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [188]:
pd.concat([df, df5], ignore_index= True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

#####  String Operations

In [201]:
name = 'anil'

In [202]:
name.capitalize()

'Anil'

In [196]:
name.lower()

' anil'

In [197]:
name.replace('i', 'ee')

' aneel'

In [200]:
help(name.capitalize)

Help on built-in function capitalize:

capitalize() method of builtins.str instance
    Return a capitalized version of the string.

    More specifically, make the first character have upper case and the rest lower
    case.

In [203]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [205]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [206]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [208]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [209]:
df['name'].str.replace('i', 'ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [210]:
df['name'].str.count('an')

0    1
1    0
2    1
3    0
4    0
5    0
6    0
7    0
8    0
9    1
Name: name, dtype: int64

In [211]:
df['name'].str.count('a')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [212]:
df['name'].str.find('i')

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

In [213]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

##### Grouping and Aggregation

In [215]:
gr = df.groupby('class')

In [216]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [217]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [219]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [220]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [221]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

In [222]:
gr['marks'].min()

class
BE    49.55
TE    56.75
Name: marks, dtype: float64

##### Boolean Filtering

In [223]:
df['marks']> 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [225]:
mask = df['marks']> 60
df[mask] # this will filter the data , shows marks above 60 only

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [227]:
df[df['marks']> 60] # direct method without using variable

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [228]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [231]:
x = df[(df['marks']> 60) & (df['class'] =='BE')] # two conditions to be satisfied

In [232]:
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [233]:
y = df[(df['marks']> 60) & (df['class'] =='BE') & (df['age']== 19 )]

In [234]:
y

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19

##### Export the data

In [235]:
x.to_csv('datasets/output.csv', index = False)

In [236]:
x.to_html('datasets/output.html', index = False)